code-review/NRB_3471_3546/База_Стало/DataProcessors/ЗагрузкаДанныхССайтаЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхССайтаЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ЗагрузкаДанныхССайтаЦБ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ОбновитьСписокВалютНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВалютНаСервере()
	ОбработкаЗагрузки = РеквизитФормыВЗначение("Объект");
	ОбработкаЗагрузки.ОбновитьСписокВалют();
	ЗначениеВРеквизитФормы(ОбработкаЗагрузки, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПериодЗагрузки.Вариант = ВариантСтандартногоПериода.Сегодня;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсы(Команда)
	ЗагрузитьКурсыНаСервере();
	ПоказатьОповещениеПользователя("Загрузка курсов валют", , РезультатВыполнения, БиблиотекаКартинок.Информация32);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыНаСервере()
	ОбработкаЗагрузки = РеквизитФормыВЗначение("Объект");
	ОбработкаЗагрузки.НачДата = ПериодЗагрузки.ДатаНачала;
	ОбработкаЗагрузки.КонДата = ПериодЗагрузки.ДатаОкончания;
	ОбработкаЗагрузки.ЗагрузитьКурсыВалют();
	ОбработкаЗагрузки.ОбновитьСписокВалют();
	РезультатВыполнения = ОбработкаЗагрузки.СообщениеПоРезультатуВыполнения;
	ЗначениеВРеквизитФормы(ОбработкаЗагрузки, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	Для каждого СтрокаДанных Из Объект.СписокВалют Цикл
		СтрокаДанных.Загружать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	Для каждого СтрокаДанных Из Объект.СписокВалют Цикл
		СтрокаДанных.Загружать = Ложь;
	КонецЦикла;
КонецПроцедуры
